Revit 2027 API
AssemblyDifferenceNamingCategory Class
 The two assemblies being compared have different naming categories
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyDifference
 Autodesk.Revit.DB.AssemblyDifferenceNamingCategory
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyDifferenceNamingCategory : AssemblyDifference
Public Class AssemblyDifferenceNamingCategory
	Inherits AssemblyDifference
public ref class AssemblyDifferenceNamingCategory : public AssemblyDifference
type AssemblyDifferenceNamingCategory =
    class
        inherit AssemblyDifference
    end
The AssemblyDifferenceNamingCategory type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from AssemblyDifference)
NamingCategoryId1 |  Naming category id of the first assembly
NamingCategoryId2 |  Naming category id of the second assembly
Top
Methods
Name | Description
Dispose
(Inherited from AssemblyDifference)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace